{
    "navbar": {
        "title": "Mon portfolio de développeur web",
        "language": "🇫🇷 FR",
        "bio": "Qui suis-je?",
        "stack": "Ma stack",
        "timeline": "Mon parcours",
        "projects": "Mes projets"
    },
    "bio": {
        "title": "Qui suis-je ?",
        "content": [
            "Jeune développeur web passionné par les technologies innovantes, la création d'applications significatives et les défis techniques.",
            "Expérience solide en développement web avec PHP, Symfony, React, HTML/CSS/JS, et plus encore.",
            "Je possède une approche proactive pour résoudre les défis techniques en utilisant mes connaissances et la collaboration avec l'équipe.",
            "Par ailleurs, je suis motivé pour apprendre rapidement de nouvelles technologies et les intégrer dans mes projets.",
            "Passionné de tennis, de randonnée et de jeux vidéo, cela me permet de rester en forme et de développer des compétences transversales.",
            "En alternance actuellement, je souhaite continuer à développer mes compétences tout en travaillant sur des projets stimulants et innovants.",
            "Convaincu de pouvoir apporter une contribution significative à une entreprise valorisant le travail d'équipe, la créativité et l'innovation."
          ]          
    },
    "stack": {
        "title": "Ma stack"
    },
    "map": {
        "title": "Ma localisation"
    },
    "timeline": {
        "title": "Mon parcours",
        "item1": "Développeur web en alternance, Mecatechnic SAS (Sep 2022-Nov 2023)",
        "item2": "Web@cadémie, Epitech Lille (Nov 2021-Nov 2023)",
        "item3": "Licence LEA anglais-espagnol, Université Bordeaux Montaigne (Sep 2019-Dec 2020)",
        "item4": "Bac ES section européenne, Lycée Sud Médoc (Juillet 2019)"
    },
    "contactForm": {
        "title": "Me contacter",
        "name": {
            "label": "Votre nom",
            "errorMessage": "Caractères interdits",
            "emptyMessage": "Veuillez remplir ce champ"
        },        
        "email": {
            "label": "Adresse mail",
            "errorMessage": "Format invalide (ex: test@gmail.com)",
            "emptyMessage": "Veuillez remplir ce champ"
        },
        "message": {
            "label": "Votre message",
            "emptyMessage": "Veuillez remplir ce champ"
        },
        "submitBtn": {
            "label": "Valider"
        },
        "toastMessage": {
            "success": "Votre message a bien été envoyé ! Je le traiterai dans les meilleurs délais",
            "error": "Impossible d'envoyer le message, veuillez réessayer ultérieurement."
        }
    }
}